tensorXFV/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.1e-3;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue $internalField;
    }


    object
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    ground
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

    symmetry
    {
        type symmetry;
    }

}

// ************************************************************************* //
// **************************** tensorXF 2025 ****************************** //
// **************************** pttensor.com ******************************* //